of60/tutorials/channel_noHeatFromViscousDissipation/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{

	type          	Oldroyd-B;
	elastEnergDiss	elastEnergDiss [0 0 0 0 0 0 0] 1;  // 1-fully entropic
	rho		rho	[1 -3  0 0 0 0 0]	921.;
	etaS		etaS	[1 -1 -1 0 0 0 0]	3e-4;  // acetone
	etaP		etaP	[1 -1 -1 0 0 0 0]	10.;  // polystyrene melt
	lambda		lambda	[0  0  1 0 0 0 0]	0.002;

	stabilization	coupling;

//      Optional terms (evaluated as true if ommited)
	newtonianDissipationTerm    false;  // false, remove term from energyEq
	viscoelasticDissipationTerm false;  // false, remove term from energyEq
}

thermophysicalProperties {
	T0              T0 [0 0 0 1 0 0 0] 463.15;

	etaSThermFun	constant;
	etaSThermFunCoefficients {
	  etaS0		etaS0 [1 -1 -1 0 0 0 0] 3e-4;  //yes, we have to repeat it :(
	};
	
	etaPThermFun    Arrhenius;
	etaPThermFunCoefficients {
	  etaP0		etaP0	[1 -1 -1 0 0 0 0]	10.;
	  c1		c1	[0  0  0 1 0 0 0]	1.72e3;
	};

	lambdaThermFun    Arrhenius;
	lambdaThermFunCoefficients {
	  lambda0	lambda0	[0  0  1 0 0 0 0]	0.002;
	  c1		c1	[0  0  0 1 0 0 0]	1.72e3;
	};

	cpThermFun	LinearFit;
	cpThermFunCoefficients {
	  cp0		cp0	[0 2 -2 -1 0 0 0]	0.4;
	  c1		c1	[0 0 0  0 0 0 0]	0.9994;
	  c2		c2	[0 0 0 -1 0 0 0]	-0.00112;
	  ;
	};

	ktThermFun	LinearFit;
	ktThermFunCoefficients {
	  kt0		kt0	[1 1 -3 -1 0 0 0]	0.08;
	  c1		c1	[0 0 0  0 0 0 0]	3.0173;
	  c2		c2	[0 0 0 -1 0 0 0]	0.00118;
	};
}

passiveScalarProperties
{
                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
